output/GeneratedJD/Pattern4CI.dot
digraph "G" {
graph ["rankdir"="BT"]
"C" ["shape"="none","margin"="0","label"=<<table cellspacing="0" cellborder="1" border="0"><tr><td COLSPAN="2" sides="LT" BGCOLOR="gray75" COLOR="royalblue">Intégration continue Valide</td><td sides="TR" BGCOLOR="gray75" COLOR="royalblue"></td><td sides="L" COLOR="royalblue"></td></tr><tr><td sides="LB" BGCOLOR="gray75" COLOR="royalblue"></td><td sides="LTRB" ROWSPAN="2" colspan="3" port="a" BGCOLOR="khaki1" style="dashed">interne</td></tr></table>>]
"PV" ["shape"="box","style"="filled,rounded","color"="royalblue","fillcolor"="none","label"="Project Valid"]
"AJS" ["shape"="box","style"="filled,rounded","color"="royalblue","fillcolor"="none","label"="Test Coverage validated and Archived"]
"SD" ["shape"="polygon","style"="filled","fillcolor"="darkolivegreen3","sides"="4","skew"=".4","label"="Data Archivate"]
"ASC" ["shape"="box","style"="filled,rounded","color"="royalblue","fillcolor"="none","label"="Archivees Data"]
"SE" ["shape"="polygon","style"="filled","fillcolor"="darkolivegreen3","sides"="4","skew"=".4","label"="Evaluate Project Quality"]
"BM" ["shape"="box","style"="filled,rounded","fillcolor"="skyblue","label"="Build Maven passed"]
"SM" ["shape"="polygon","style"="filled","fillcolor"="darkolivegreen3","sides"="4","skew"=".4","label"="Evaluate Maven Project"]
"M" ["shape"="box","style"="filled,rounded","color"="royalblue","fillcolor"="none","label"="Maven ready"]
"SJA" ["shape"="polygon","style"="filled","fillcolor"="darkolivegreen3","sides"="4","skew"=".4","label"="testCoverage Archivate"]
"JV" ["shape"="box","style"="filled,rounded","color"="royalblue","fillcolor"="none","label"="Test Coverage validated"]
"JA" ["shape"="box","style"="filled,rounded","fillcolor"="skyblue","label"="Jacoco report Archivate"]
"SJ" ["shape"="polygon","style"="filled","fillcolor"="darkolivegreen3","sides"="4","skew"=".4","label"="Validate testCoverage"]
"IA" ["shape"="box","style"="filled,rounded","fillcolor"="skyblue","label"="images Archivate"]
"RJ" ["shape"="box","style"="filled,rounded","fillcolor"="skyblue","label"="Jacoco Report"]
"TM" ["shape"="box","style"="filled,rounded","fillcolor"="skyblue","label"="Test Maven passed"]
"CA" ["shape"="box","style"="filled,rounded","fillcolor"="skyblue","label"="code Archivate"]
"PV" -> "C"
"AJS" -> "SD"
"AJS" -> "SE"
"SD" -> "ASC"
"ASC" -> "SE"
"SE" -> "PV"
"BM" -> "SM"
"SM" -> "M"
"M" -> "SE"
"SJA" -> "AJS"
"JV" -> "SJA"
"JA" -> "SJA"
"SJ" -> "JV"
"IA" -> "SD"
"RJ" -> "SJ"
"RJ" -> "SJA"
"TM" -> "SM"
"CA" -> "SD"
}
